print("=== ПРОГРАММА ДЛЯ ОЦЕНКИ ПРОДУКТА ===") #Обьяснение пользователю
try:
    rating = int(input("Введите рейтинг от 1 до 10: ")) #ввод пользователем цифры рейтинга
except:
    rating = 0

print("\n" + "="*30) # верхняя рамочка
"""
Дальше производится проверка спомощью конструкции match - case входит ли число в заданный диапазон
"""
match rating:
    case 9 | 10:
        desc = "отличный"
        emoji = "😍🎉🤩🔥"
        rec = "рекомендую"
    case 7 | 8:
        desc = "хороший"
        emoji = "😊👍✨🎯"
        rec = "рекомендую"
    case 5 | 6:
        desc = "средний"
        emoji = "😐👌🌀"
        rec = "можно попробовать"
    case 3 | 4:
        desc = "плохой"
        emoji = "😕👎🌧️"
        rec = "не рекомендую"
    case 1 | 2:
        desc = "очень плохой"
        emoji = "😠💀🚫"
        rec = "категорически не рекомендую"
    case _: #Проверка на ошибку при вводе
        desc = "ошибка"
        emoji = "❌🤔❓"
        rec = "введите число от 1 до 10"

print(f"Рейтинг: {rating} {desc} {emoji} {rec} ")#вывод результатов

print("="*30) #Нижняя рамочка
